{
  "pages": [
    {
      "imageUrl": "page1.jpg",
      "pageNumber": 1,
      "pageText": "Once upon a time, there lived a man and a woman named Mr. and Mrs. Okafor. They had two children, a daughter named Ada and a son named Ebuka. "
    },
    {
      "imageUrl": "page2.jpg",
      "pageNumber": 2,
      "pageText": "They lived in the most beautiful house on Opara street in the city of Onitsha. "
    },
    {
      "imageUrl": "page3.jpg",
      "pageNumber": 3,
      "pageText": "The Okafor’s were very wealthy. They provided everything for their children, both what they needed and wanted. Ada and Ebuka went to the best schools and wore the best clothes."
    },
    {
      "imageUrl": "page4.jpg",
      "pageNumber": 4,
      "pageText": "The children each had their own big bedroom. Each of the rooms had beautiful wall decorations, a fluffy rug and colorful bedding."
    },
    {
      "imageUrl": "page5.jpg",
      "pageNumber": 5,
      "pageText": "Ada and Ebuka also had a room full of lovely toys and musical instruments. "
    },
    {
      "imageUrl": "page6.jpg",
      "pageNumber": 6,
      "pageText": "Every year, the family travelled outside of the country to visit a place where the children could find a new adventure. One time, they visited Disney World in Florida."
    },
    {
      "imageUrl": "page7.jpg",
      "pageNumber": 7,
      "pageText": "When they returned from their trip, they shared the wonderful experiences they had with their friends. "
    },
    {
      "imageUrl": "page8.jpg",
      "pageNumber": 8,
      "pageText": "Their friends were excited to hear about all the fun things Ada and Ebuka did during their trip to Disney World. Ada and Ebuka were the envy of all these other kids."
    },
    {
      "imageUrl": "page9.jpg",
      "pageNumber": 9,
      "pageText": "Mrs. Okafor became worried. She worried that her children had no idea what it meant to suffer or be poor."
    },
    {
      "imageUrl": "page10.jpg",
      "pageNumber": 10,
      "pageText": "If they didn’t learn about life difficulties, they might grow up thinking life was easy and perfect. They wouldn’t understand how to face struggles and hard times. "
    },
    {
      "imageUrl": "page11.jpg",
      "pageNumber": 11,
      "pageText": "One day, she decided to expose her children to something new. It was going to be a taste of what was on the other side of life."
    },
    {
      "imageUrl": "page12.jpg",
      "pageNumber": 12,
      "pageText": "Mrs. Okafor hoped that by doing this, Ada and Ebuka could appreciate the privileges of their life and learn to be compassionate towards others who didn’t have the same. "
    },
    {
      "imageUrl": "page13.jpg",
      "pageNumber": 13,
      "pageText": "So, she took them to visit an orphanage in the nearby city of Nkwelle. "
    },
    {
      "imageUrl": "page14.jpg",
      "pageNumber": 14,
      "pageText": "When they arrived at the orphanage, the attendant wrote their names in the log book."
    },
    {
      "imageUrl": "page15.jpg",
      "pageNumber": 15,
      "pageText": "Ada and Ebuka saw about twenty-five children all seated in a small hall. There were both boys and girls."
    },
    {
      "imageUrl": "page16.jpg",
      "pageNumber": 16,
      "pageText": "As they walked towards the hall to see the kids, they could hear babies crying in other rooms. “Do the children all live here in this place?” Ada asked. “Yes, they do,” said her mom."
    },
    {
      "imageUrl": "page17.jpg",
      "pageNumber": 17,
      "pageText": "“Even the babies?” asked Ebuka. “Oh yes, even the babies,” said their mom. “That’s so sad,” Ada and Ebuka chorused."
    },
    {
      "imageUrl": "page18.jpg",
      "pageNumber": 18,
      "pageText": "“Where are their parents?” Ada asked. “Most of their parents are no more,” said Mrs. Okafor gently. “Some parents, however, put their children in the orphanage because they can’t take care of them,” she added."
    },
    {
      "imageUrl": "page19.jpg",
      "pageNumber": 19,
      "pageText": "A bell rang, and the kids filed to the kitchen to get their lunch. Some of the kids looked admiringly at Ada and Ebuka’s beautiful clothes and shoes."
    },
    {
      "imageUrl": "page20.jpg",
      "pageNumber": 20,
      "pageText": "The children at the orphanage did not look as healthy as Ada and Ebuka. Some of them looked thin and hungry. Some of them wore very old shoes, while others walked on bare, dirty feet. "
    },
    {
      "imageUrl": "page21.jpg",
      "pageNumber": 21,
      "pageText": "Ada asked her mom, “Why is that little girl wearing a torn dress?” “Because, that is all she has,” her mom answered."
    },
    {
      "imageUrl": "page22.jpg",
      "pageNumber": 22,
      "pageText": "“Why are they eating rice without chicken and juice?” Ebuka asked. “Well, the orphanage cannot afford that luxury,” Mrs. Okafor said. "
    },
    {
      "imageUrl": "page23.jpg",
      "pageNumber": 23,
      "pageText": "After about an hour at the orphanage, Ada and Ebuka left very sad, wishing they had brought more gifts for the children."
    },
    {
      "imageUrl": "page24.jpg",
      "pageNumber": 24,
      "pageText": "They had not known that there were kids who had no parents or who had to worry about what they would eat each day."
    },
    {
      "imageUrl": "page25.jpg",
      "pageNumber": 25,
      "pageText": "When they returned home later in the evening, Ada asked her mom, “Can we visit the kids at the orphanage again?”"
    },
    {
      "imageUrl": "page26.jpg",
      "pageNumber": 26,
      "pageText": " “Can we take some of our clothes and chocolates to them?” she questioned. “Can we give them some of our toys?” Ebuka added. “Yes, yes,” said their mom warmly. "
    },
    {
      "imageUrl": "page27.jpg",
      "pageNumber": 27,
      "pageText": "That night before they went to bed, Ebuka and Ada prayed for the children at the Orphanage. "
    },
    {
      "imageUrl": "page28.jpg",
      "pageNumber": 28,
      "pageText": "Ada gave her dad a big hug and said, “Thank you dad for loving me and providing for me.”"
    },
    {
      "imageUrl": "page29.jpg",
      "pageNumber": 29,
      "pageText": "Ebuka gave his mom a big hug and said, “Thank you for buying me lots of clothes and toys,” You are the best mom ever!"
    }
  ]
}
